; -------------------------------------------------------------------------------------------------
;
; 7z SFX Builder Language File
;
; Translation Instructions:
;	File extension must be '.ini' in order to make 7z SFX Builder load language file.
;	DON'T remove SECTION NAMES! (ex: [LangOptions], [Global] ...)
;	Update your and language information in 'LangOptions' section
;	Save the file in Unicode format
;	E-mail new language files to mirza.b.1695@gmail.com for inclusion in main installer.
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function.
;	\n - indicates a newline character, which will be replaced when displayed.
;	\~n - indicates double newline character.
;	\s - indicates a special strings (generally file names)
;		The order and number of \s variables is very important and should not be modified.
;	\~s - same as \s. only quotes are added.
;
; -------------------------------------------------------------------------------------------------


[LangOptions]
LANG_NAME="Korean"
LANG_NATIVE_NAME="한국어"
VERSION=2.0.7
NAME=4Li
CONTACT=

[Global]
TIP_ADD="추가"
TIP_EDIT="편집"
TIP_DELETE="삭제"
TIP_DELETE_ALL="모두 삭제"
TIP_MOVE_UP="위로 옮기기"
TIP_MOVE_DOWN="아래로 옮기기"
BTN_SAVE="저장"
BTN_CANCEL="취소"
CHK_QUOTES="따옴표로 묶음"
LST_SEC_QUOTES="따옴표"
ERROR_MSG_TITLE="오류!"
WARNING_MSG_TITLE="경고"
INFORMATION_MSG_TITLE="정보"
QUESTION_MSG_TITLE="물음"
BTN_OK="확인"
TEST="테스트"
TIP_BROWSE="파일 찾아보기"
TIP_OPEN="파일 위치 열기"

[Menu]
MENU_FILE="파일(&F)"
MENU_SETTINGS="설정(&S)"
MENU_HELP="도움말(&H)"
MI_OPEN="파일 열기(&O)..."
MI_RELOAD="다시 열기(&E)"
MI_SAVE="저장(&S)"
MI_SAVE_AS="다른 이름으로 저장(&A)..."
MI_CLOSE="닫기(&C)"
SUB_MENU_RECENT_FILES="최근 파일(&R)"
MI_CLEAR_LIST="목록 지우기(&L)"
MI_EXIT="끝내기(&X)"
MI_OPTIONS="옵션(&O)"
SUB_MENU_LANG="언어(&L)"
MI_HELP="도움말(&P)"
MI_SITE="프로젝트 사이트(&S)"
MI_ABOUT="정보(&B)"
MI_PRESET_MANAGER="프리셋 관리"

[ToolbarTips]
OPEN="파일 열기"
SAVE="저장"
SAVE_AS="다른 이름으로 저장"
CLOSE="파일 닫기"
TEST="테스트"
PRESET="프리셋 관리"
MAKE_SFX="SFX 만들기"
OPTIONS="프로그램 옵션"

[TabNames]
MAIN="메인"
TITLE_TEXT="제목/문구"
DIALOGS="대화상자"
RUN="실행"
DELETE="삭제"
SHORTCUTS="바로가기"
SET_ENV="환경 변수 설정"
OUTPUT="출력"
SFX="SFX"

[Tab_Main]
CHK_TEMP_MODE="임시 방식"
CHK_SKIP_LOCKED="시스템 잠금 파일 무시"
CHK_DELETE_SFX="추출한 후 SFX 파일 삭제"
CHK_BPT="BeginPrompt 지연 시간:"
CHK_XDWIDTH="ExtractDialog 너비:"
CHK_XPWIDTH="ExtractPath 너비:"
RAD_OW_MODE_1="모든 파일 덮어쓰기"
RAD_OW_MODE_2="파일 덮어쓰지 않음"
RAD_OW_MODE_3="이전 파일 덮어쓰기"
RAD_GUI_MODE_1="모든 GUI 보이기"
RAD_GUI_MODE_2="추출할 때 '취소' 사용 안함"
RAD_GUI_MODE_3="모든 GUI 창 감추기"
GRP_OW_MODE="덮어쓰기 방식:"
GRP_GUI_MODE="GUI 방식:"
LBL_EXT_PATH="추출 경로:"
MI_SFX_NAME="SFX 이름"
MI_SFX_PATH="SFX 경로"
TIP_EDIT="편집하려면 누르세요."
TIP_INSERT="변수를 삽입하려면 누르세요."
TIP_RELOAD="다시 불러오기"
TIP_OPEN="기본 텍스트 편집기로 열기"

[Tab_TitleText]
GRP_TITLE="제목"
GRP_TEXT="문구"
LBL_WIN_TITLE="창 제목:"
LBL_EXT_PATH_WIN_TITLE="추출 경로 창의 제목:"
LBL_EXT_WIN_TITLE="추출 창의 제목:"
LBL_ERROR_WIN_TITLE="오류 메시지 창의 제목:"
LBL_WARN_WIN_TITLE="작업 메시지 창의 제목:"
LBL_PASSWD_TITLE="비밀번호 제목:"
LBL_PASSWD_TEXT="비밀번호 문구:"
LBL_EXT_CANCEL_TEXT="추출 취소 문구:"

[Tab_RunProgram]
LST_SEC_PARAMETER="매개 변수"
LST_SEC_PREFIX="접두사"
LST_SEC_FILE_FOLDER="파일 경로"
LST_SEC_COMMANDS="명령"

[Tab_Delete]
LST_SEC_PARAMETER="매개 변수"
LST_SEC_FILE_FOLDER="파일/폴더 경로"

[Tab_Shortcuts]
LST_SEC_PARAMETER="매개 변수"
LST_SEC_PATH="경로"
LST_SEC_SRC="소스"
LST_SEC_CMDS="명령"
LST_SEC_NAME="이름"
LST_SEC_DESC="설명"
LST_SEC_DEST="대상"
LST_SEC_WD="작업 디렉토리"
LST_SEC_ICON="아이콘"
LST_SEC_INDEX="색인"

[Tab_SetEnvironment]
LST_SEC_NAME="변수 이름"
LST_SEC_VALUE="값"

[Tab_SFX]
BTN_SELECT="선택..."
BTN_MAKE_SFX="SFX 만들기"
BTN_SFX_OPTIONS="SFX 옵션"
BTN_EDIT_VERS="버전 정보 편집"
CHK_INCLUDE_PATH="구성 파일에 경로 포함"
CHK_USE_SELECTED_CFG="선택한 구성 파일 사용"
GRP_SFX_FILES="SFX 파일"
GRP_SFX_ICON="아이콘"
LBL_CONFIG_FILE="구성 파일:"
LBL_7Z_ARCHIVE="7z 압축:"
LBL_SFX_MODULE="SFX 모듈:"
LBL_SFX_PATH="SFX 경로:"
LBL_SFX_ICON="SFX 아이콘:"

[GUI_ProgramOptions]
GUI_TITLE="프로그램 옵션"
BTN_INTEGRATE="컨텍스트 메뉴에 통합"
BTN_EXPORT="내보내기..."
MI_REGISTRY="레지스트리 파일..."
MI_INI="INI 파일..."
CHK_USERMODE="레지스트리에 설정 저장"
CHK_AUTODEFMOD="불러들인 구성이 없는 경우, 자동으로 기본 모듈 사용"
CHK_IGNORE_EMPTY="빈 버전 정보 키를 만들지 않기"
CHK_AUTO_NAME_SFX="SFX 경로를 정의하지 경우, 압축파일 디렉토리에 SFX 파일 만들기"
CHK_OVERWRITE_FILES="기존 SFX 파일 덮어쓰기"
GRP_PROGRAM="프로그램"
GRP_SFX="SFX"
LBL_LANGUAGE="인터페이스 언어:"

[GUI_PresetManager]
GUI_TITLE="프리셋 관리자"
GUI_TITLE2="새 프리셋"
GUI_TITLE3="프리셋 이름 바꾸기"
BTN_NEW="새 이름"
BTN_LOAD="불러오기"
BTN_SAVE="저장"
BTN_EDIT="이름 편집"
BTN_DELETE="삭제"
LBL_NAME="프리셋 이름 입력:"

[GUI_ArchiveSets]
CHK_SUBFILES="주어진 폴더에 위치한 파일/폴더만 압축"
LBL_DRAGDROP="파일/폴더를 추가하는데 끌어다 놓기 기능을 사용할 수 있습니다."
TIP_ADDFILE="파일 추가"
TIP_ADDFOLDER="폴더 추가"

[GUI_SFXOpts]
GUI_TITLE="SFX 옵션"
TAB_SFX_OPTIONS="SFX 옵션"
TAB_ARCHIVE_FILES="파일 압축"
CHK_USE_UPX="UPX로 SFX 모듈 압축"
CHK_USE_SFX_MOD="다음의 SFX 모듈 사용:"
CMB_USE_7ZIP1="항상 7-Zip 사용"
CMB_USE_7ZIP2="압축 파일을 지정한 경우, 7-Zip만 사용"
CMB_USE_7ZIP3="7z 압축 파일을 지정한 경우, 7-Zip 사용 안함"
CMB_USE_7ZIP4="절대 7-Zip 사용 안함"
LBL_PATH="7-Zip 경로"
TIP_BROWSE="7-Zip 경로 선택"
TIP_CONFIG="7-Zip 구성"
7ZIP_TITLE="7-Zip 구성"
7ZIP_LEVEL="압축 수준:"
7ZIP_METHOD="압축 방법:"
7ZIP_DICT="사전 크기:"
7ZIP_SOLID="솔리드 블럭 크기:"

[GUI_VersionInfo]
GUI_TITLE="파일 버전 정보 편집"
BTN_LOAD="불러오기"
MI_LOAD_SFXMOD="선택한 SFX 모듈로부터"
MI_LOAD_FILE="파일로부터..."
MI_LOAD_VALUES="저장된 값 불러오기"
MI_SAVE_VALUES="현재 값 저장"
CHK_INCLUDE="구성 파일에 정보 포함"
CHK_CHANGE_VERS="버전 정보 바꾸기"

[GUI_Gui.MiscFlags]
GUI_TITLE="GUI/기타 플래그 편집"
BTN_NEW="새로"
BTN_LOAD="불러오기"
BTN_RESET="초기화"
BTN_DELETE="삭제"
LBL_GUI_FLAG_1="제목 표시줄의 오른쪽에 추출 비율 보이기 (기본값: 왼쪽)"
LBL_GUI_FLAG_2="제목 표시줄에 추출 비율 표시하지 않기"
LBL_GUI_FLAG_4="진행 표시줄 아래에 추출 비율 보이기시"
LBL_GUI_FLAG_8="Windows XP 모양 사용 (구성표)"
LBL_GUI_FLAG_16="추출 비율에 굵은 글꼴 사용"
LBL_GUI_FLAG_32="추출 진행 창에 아이콘 표시"
LBL_GUI_FLAG_64="'BeginPrompt' 창을 사용해 추출 경로 지정"
LBL_GUI_FLAG_128="별도 창을 사용해 추출 경로 지정"
LBL_GUI_FLAG_256="설치/추출의 중단 확인"
LBL_GUI_FLAG_512="모든 창의 제목 표시줄과 [Alt+Tab]에 아이콘을 표시하지 않기"
LBL_GUI_FLAG_1024="추출 경로 지정 창에 아이콘 표시"
LBL_GUI_FLAG_2048="'BeginPrompt' 창에 아이콘 표시"
LBL_GUI_FLAG_4096="아이콘 및 단추 이름 바꾸기. '예'-'아니오' 대신에 '확인'-'취소' 사용"
LBL_GUI_FLAG_8192="Windows 7 또는 그 이후 버전의 작업 표시줄에 진행 표시 보이지 않기"
LBL_GUI_FLAG_16384="문구에 '&&' 기호 보이기"
LBL_MISC_FLAG_1="추출에 필요한 여유 디스크 공간 확인하지 않기"
LBL_MISC_FLAG_2="추출에 필요한 여유 메모리 용량 확인하지 않기"
LBL_MISC_FLAG_4="모든 작업에 관리자 권한 요구"
LBL_MISC_FLAG_8="'BeginPrompt' 및 'ExtractPath' 창 이후 비밀번호 요구 창 보이기"

[GUI_RunProgram]
GUI_TITLE="추출 후 실행할 프로그램 추가"
GUI_PFX_TITLE="접두사 편집"
LBL_PARAMETER="매개 변수:"
LBL_FILE="파일:"
LBL_PREFIX="접두사:"
LBL_COMMANDS="명령:"

[GUI_Delete]
GUI_TITLE="추출 후 삭제할 파일 추가"
LBL_PARAMETER="매개 변수:"
LBL_FILE="파일/폴더:"

[GUI_Shortcuts]
GUI_TITLE="바로가기 추가"
RAD_DESKTOP="바탕 화면"
RAD_START_MENU="시작 메뉴"
RAD_PROGRAMS="시작 메뉴\프로그램"
RAD_STARTUP="시작"
RAD_CURRENT_USER="현재 사용자"
RAD_ALLUSERS="모든 사용자"
GRP_CREATION_PATH="만들 위치"
GRP_CREATE_FOR="생성"
GRP_PARAMETER="매개 변수:"
LBL_SOURCE_FILE="소스 파일:"
LBL_ARGUMENTS="인수:"
LBL_NAME="바로가기 이름:"
LBL_DESCRIPTION="바로가기 설명:"
LBL_DEST_FOLDER="대상 폴더:"
LBL_WORKING_DIR="작업 디렉토리:"
LBL_ICON_FILE="아이콘 파일:"
LBL_ICON_INDEX="아이콘 색인:"

[GUI_SetEnvironment]
GUI_TITLE="환경 변수 만들기"
LBL_NAME="이름:"
LBL_VALUE="값:"

[GUI_MakeSFX]
GUI_TITLE="SFX 만드는 중..."
BTN_OPEN="찾아보기"
BTN_RUN="SFX 실행"
BTN_CLOSE="닫기"
REPORT_PREP="준비하는 중..."
REPORT_ARCHIVE1="압축파일 만드는 중..."
REPORT_ARCHIVE2="7-Zip이 없습니다!"
REPORT_ARCHIVE3="파일이 없습니다: \~s"
REPORT_ARCHIVE4="압축 파일을 자~알 만들었습니다."
REPORT_ARCHIVE5="압축 파일을 만들 수 없습니다!"
REPORT_ERROR1="구성 파일을 찾을 수 없습니다: \~s"
REPORT_ERROR2="다음 파일은 7z SFX 구성 파일이 아닙니다: \~s"
REPORT_ERROR3="SFX 만드는 중 오류가 발생했습니다!"
REPORT_ICON1="SFX 아이콘 바꾸는 중..."
REPORT_ICON2="SFX 아이콘을 자~알 바꿨습니다."
REPORT_ICON3="SFX 아이콘을 바꿀 수 없습니다!"
REPORT_VERSINFO1="버전 정보 갱신하는 중..."
REPORT_VERSINFO2="버전 정보를 자~알 갱신했습니다."
REPORT_VERSINFO3="버전 정보를 갱신할 수 없습니다!"
REPORT_UPX1="UPX로 압축하는 중..."
REPORT_UPX2="압축이 자~알 됐습니다"
REPORT_UPX3=""upx.exe"를 찾을 수 없습니다!"
REPORT_BUILD1="SFX 빌드 중..."
REPORT_BUILD2="SFX 빌드 중 오류가 발생했습니다!"
REPORT_FINISH="SFX가 자~알 만들어졌습니다: \~s"

[MessageBoxes]
; 파일 열기/저장 작업
MSGBOX1_1="언어 파일을 찾을 수 없습니다!"
MSGBOX1_2="지정한 파일이 없습니다!"
MSGBOX1_3="파일이 불러들여지지 않았거나 없습니다!"
MSGBOX1_4="지정한 구성 파일이 없습니다!"
MSGBOX1_5="파일을 열까요: \~n\~s - ?"
MSGBOX1_6="\~s\n은(는) 7z SFX 구성 파일이 아닙니다!\~n어쨋든 불러올까요?"
MSGBOX1_7="파일 크기가 일반 구성 파일보다 큽니다!\n어쨌든 불러올까요?"
MSGBOX1_8="현재 작업에 필요한 파일이 없습니다:\n\s"
MSGBOX1_9="이 파일은 구성 파일을 포함하고 있아 계속할 수 없습니다!"
MSGBOX1_10="파일을 다시 불러올까요?"
MSGBOX1_11="현재 구성은 저장되지 않았습니다. 지금 저장할까요?"
MSGBOX1_12="현재 작업이 요구하는 파일이 누락되었습니다:\n\s\n어쨋든 계속하시겠습니까? (권장하지 않음)"
; SFX 만들기
MSGBOX2_1="지정한 SFX 파일이 경로에 없습니다!"
MSGBOX2_2="SFX 모듈을 지정하지 않았습니다!"
MSGBOX2_3="지정한 SFX 모듈이 없거나 필요한 형식을 갖고 있지 않습니다!"
MSGBOX2_4="압축 파일을 지정하지 않았습니다!"
MSGBOX2_5="압축을 지정하지 않았습니다!"
MSGBOX2_6="지정한 압축이 없거나 필요한 형식을 갖고 있지 않습니다!"
MSGBOX2_7="기존 파일을 덮어쓸까요: \~n\~s - ?"
MSGBOX2_8="7-Zip이 없습니다!"
MSGBOX2_9="다음의 압축 파일을 사용할까요: \~n\~s - ?\~n구성 파일에 정의된 파일로부터 새 압축 파일을 만드려면 '아니오'를 누르세요."
; 기타 작업
MSGBOX3_1="컨텍스트 메뉴에 자~알 통합됐습니다."
MSGBOX3_2="테스트 중인 창을 닫으려면, '확인'을 누르세요."
MSGBOX3_3="기존 값을 덮어쓸까요?"
MSGBOX3_4="적어도 한 개의 항목을 선택하세요."
MSGBOX3_5="한 개의 항목만 선택하세요."
MSGBOX3_6="선택한 항목을 삭제할까요?"
MSGBOX3_7="모든 항목을 삭제할까요?"
MSGBOX3_8="지정한 데이터가 잘못됐거나 비어 있습니다!"
MSGBOX3_9="파일을 지정하지 않았습니다!"
